simpkins/mantyl/src/components/mantyl_usb/Esp32UsbDevice.cpp
// Copyright (c) 2022, Adam Simpkins
#include "mantyl_usb/Esp32UsbDevice.h"

#include <esp_check.h>
#include <esp_log.h>
#include <esp_private/usb_phy.h>
#include <soc/periph_defs.h>
#include <soc/usb_periph.h>

#include <atomic>
#include <cstring>

namespace {
const char *LogTag = "mantyl.usb.esp32";

inline void set_bits(volatile uint32_t &value, uint32_t bits) {
  value = (value | bits);
}
inline void clear_bits(volatile uint32_t &value, uint32_t bits) {
  value = (value & ~bits);
}

template<class... Ts> struct overloaded : Ts... { using Ts::operator()...; };
template<class... Ts> overloaded(Ts...) -> overloaded<Ts...>;

} // namespace

namespace mantyl {

Esp32UsbDevice::~Esp32UsbDevice() {
  if (interrupt_handle_) {
    esp_intr_free(interrupt_handle_);
  }
  if (phy_) {
    usb_del_phy(phy_);
  }
}

void Esp32UsbDevice::loop() {
  int n = 0;
  while (true) {
    static constexpr TickType_t max_wait = pdMS_TO_TICKS(1000);
    Event event;
    if (xQueueReceive(event_queue_, &event, max_wait) == pdTRUE) {
      printf("got event: %d\n", static_cast<int>(event.index()));
      handle_event(event);
    }
    printf("tick %d\n", n);
    ++n;
  }
}

void Esp32UsbDevice::handle_event(Event& event) {
  std::visit(
      overloaded{
          [this](UninitializedEvent &) {
            // this shouldn't be possible
            ESP_EARLY_LOGE(LogTag, "unexpected USB uninitialized event");
          },
          [this](BusResetEvent &ev) { on_bus_reset(ev.max_ep0_packet_size); },
          [this](SuspendEvent &) { on_suspend(); },
          [this](ResumeEvent &) { on_resume(); },
          [this](SetupPacket &packet) { on_setup_received(packet); },
          [this](InXferCompleteEvent &event) {
            on_in_transfer_complete(event.endpoint_num, event.total_length);
          },
          [this](InXferFailedEvent &event) {
            on_in_transfer_failed(event.endpoint_num);
          },
          [this](OutXferCompleteEvent &event) {
            on_out_transfer_complete(event.endpoint_num, event.total_length);
          },
      },
      event);
}

void Esp32UsbDevice::send_event_from_isr(const Event& event) {
  BaseType_t higher_prio_task_woken;
  BaseType_t res =
      xQueueSendToBackFromISR(event_queue_, &event, &higher_prio_task_woken);
  if (higher_prio_task_woken) {
    portYIELD_FROM_ISR();
  }

  if (res != pdPASS) {
    ESP_EARLY_LOGW(LogTag, "USB event queue full; unable to send event");
  }
}

esp_err_t Esp32UsbDevice::init(PhyType phy_type) {
  ESP_LOGI(LogTag, "USB device init");

  event_queue_ = xQueueCreateStatic(
      kMaxEventQueueSize, sizeof(Event), queue_buffer_.data(), &queue_storage_);

  const auto err = init_phy(phy_type);
  if (err != ESP_OK) {
    return err;
  }

  // The ESP32-S3 technical reference manual doesn't seem to document the USB
  // registers terrible well, at least as far as I can find.  The soc/usb_reg.h
  // has a few comments documenting some of the behavior.
  //
  // This initialization logic was largely adapted from the ESP DCD code in
  // TinyUSB.

  // Ensure the data line pull-up is disabled as we perform initialization.
  set_bits(usb_->dctl, USB_SFTDISCON_M);

  // During initialization, send a stall on receipt of
  // any non-zero length OUT packet.  Also set speed.
  set_bits(usb_->dcfg, USB_NZSTSOUTHSHK_M | Speed::Full48Mhz);

  // Configure AHB interrupts:
  // - enable interrupt when TxFIFO is empty
  // - global interrupts enable flag
  set_bits(usb_->gahbcfg, USB_NPTXFEMPLVL_M | USB_GLBLLNTRMSK_M);
  // USB configuration:
  // - Force device mode (rather than OTG)
  set_bits(usb_->gusbcfg, USB_FORCEDEVMODE_M);
  // OTG configuration:
  // - disable overrides
  clear_bits(usb_->gotgctl,
             USB_BVALIDOVVAL_M | USB_BVALIDOVEN_M | USB_VBVALIDOVVAL_M);

  // Configure all endpoints to NAK
  all_endpoints_nak();

  // Interrupt configuration
  usb_->gintmsk = 0;          // mask all interrupts
  usb_->gotgint = 0xffffffff; // clear OTG interrupts
                              // (even though we leave OTG interrupts disabled)
  usb_->gintsts = 0xffffffff; // clear pending interrupts
  usb_->gintmsk = USB_MODEMISMSK_M | USB_RXFLVIMSK_M | USB_ERLYSUSPMSK_M |
                 USB_USBSUSPMSK_M | USB_USBRSTMSK_M | USB_ENUMDONEMSK_M |
                 USB_RESETDETMSK_M | USB_DISCONNINTMSK_M;

  ESP_RETURN_ON_ERROR(
      enable_interrupts(), LogTag, "error enabling USB interrupts");

  // Enable the data line pull-up to connect to the bus.
  clear_bits(usb_->dctl, USB_SFTDISCON_M);

  return ESP_OK;
}

esp_err_t Esp32UsbDevice::init_phy(PhyType phy_type) {
  usb_phy_gpio_conf_t gpio_conf = {
      .vp_io_num = USBPHY_VP_NUM,
      .vm_io_num = USBPHY_VM_NUM,
      .rcv_io_num = USBPHY_RCV_NUM,
      .oen_io_num = USBPHY_OEN_NUM,
      .vpo_io_num = USBPHY_VPO_NUM,
      .vmo_io_num = USBPHY_VMO_NUM,
  };
  usb_phy_config_t phy_conf = {
      .controller = USB_PHY_CTRL_OTG,
      .target = phy_type == PhyType::External ? USB_PHY_TARGET_EXT
                                              : USB_PHY_TARGET_INT,
      .otg_mode = USB_OTG_MODE_DEVICE,
      .otg_speed = USB_PHY_SPEED_UNDEFINED,
      .gpio_conf = phy_type == PhyType::External ? &gpio_conf : nullptr,
  };
  ESP_RETURN_ON_ERROR(
      usb_new_phy(&phy_conf, &phy_), LogTag, "error configuring USB PHY");
  return ESP_OK;
}

esp_err_t Esp32UsbDevice::enable_interrupts() {
  return esp_intr_alloc(ETS_USB_INTR_SOURCE,
                        ESP_INTR_FLAG_LOWMED,
                        Esp32UsbDevice::static_interrupt_handler,
                        this,
                        &interrupt_handle_);
}

void Esp32UsbDevice::all_endpoints_nak() {
  for (int ep_num = 0; ep_num < USB_OUT_EP_NUM; ++ep_num) {
    set_bits(usb_->out_ep_reg[ep_num].doepctl, USB_DO_SNAK0_M);
  }
}

void Esp32UsbDevice::static_interrupt_handler(void *arg) {
  auto *usb = static_cast<Esp32UsbDevice *>(arg);
  usb->interrupt_handler();
}

void Esp32UsbDevice::interrupt_handler() {
  const uint32_t mask = usb_->gintmsk;
  const uint32_t int_status = usb_->gintsts & mask;
  static std::atomic<unsigned int> s_intr_count;
  auto intr_count = s_intr_count.fetch_add(1);
  ESP_EARLY_LOGI(LogTag,
                 "USB interrupt %u: 0x%02" PRIx32 " 0x%02" PRIx32,
                 intr_count,
                 mask,
                 int_status);

