simpkins/mantyl/src/components/mantyl_usb/Esp32UsbDevice.cpp
  // Check int_status for all of the interrupt bits that we need to handle.
  // As we process each interrupt, set that bit in gintsts to clear the
  // interrupt.  Do this before sending the event back to the main task, as
  // send_event_from_isr() may yield back to another higher priority task
  // before returning.

  if (int_status & (USB_USBRST_M | USB_RESETDET_M)) {
    // USB_USBRST_M indicates a reset.
    // USB_RESETDET_M indicates a reset detected while in suspend mode.
    //
    // These two tend to be asserted together when first initializing the bus
    // as a device.
    ESP_EARLY_LOGI(LogTag, "USB int: reset");
    usb_->gintsts = USB_USBRST_M | USB_RESETDET_M;
    allocated_fifos_ = 1;
    bus_reset();
  }

  if (int_status & USB_ENUMDONE_M) {
    usb_->gintsts = USB_ENUMDONE_M;
    enum_done();
  }

  if (int_status & USB_ERLYSUSPMSK_M) {
    ESP_EARLY_LOGI(LogTag, "USB int: early suspend");
    usb_->gintsts = USB_ERLYSUSPMSK_M;
  }

  if (int_status & USB_USBSUSP_M) {
    ESP_EARLY_LOGI(LogTag, "USB int: suspend");
    usb_->gintsts = USB_USBSUSP_M;
    send_event_from_isr<SuspendEvent>();
  }

  if (int_status & USB_WKUPINT_M) {
    ESP_EARLY_LOGI(LogTag, "USB int: resume");
    usb_->gintsts = USB_WKUPINT_M;
    send_event_from_isr<ResumeEvent>();
  }

  if (int_status & USB_SOF_M) {
    // Start of frame.
    //
    // We only enable SOF interupts to detect when the bus has resumed after we
    // have triggered a remote wakeup.  Re-disable SOF interrupts, and then
    // send a resume event to the main event handler.
    ESP_EARLY_LOGI(LogTag, "USB int: start of frame");
    usb_->gintsts = USB_SOF_M;
    clear_bits(usb_->gintmsk, USB_SOFMSK_M);
    send_event_from_isr<ResumeEvent>();
  }

  if (int_status & USB_RXFLVI_M) {
    ESP_EARLY_LOGI(LogTag, "USB int: rx");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; this will be cleared when we read from the fifo.

    // Disable the RXFLVL interrupt while reading data from the FIFO
    clear_bits(usb_->gintmsk, USB_RXFLVIMSK_M);
    read_rx_fifo();
    set_bits(usb_->gintmsk, USB_RXFLVIMSK_M);
  }

  if (int_status & USB_OEPINT_M) {
    // OUT endpoint interrupt
    ESP_EARLY_LOGI(LogTag, "USB int: OUT endpoint");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; handle_out_endpoint_intr() will update the endpoint doepint
    // register instead.
    handle_out_endpoint_intr();
  }

  if (int_status & USB_IEPINT_M) {
    // IN endpoint interrupt
    ESP_EARLY_LOGI(LogTag, "USB int: IN endpoint");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; handle_in_endpoint_intr() will update the endpoint diepint
    // register instead.
    handle_in_endpoint_intr();
  }

  // Clear other interrupt bits that we do not handle.
  usb_->gintsts = USB_CURMOD_INT_M | USB_MODEMIS_M | USB_NPTXFEMP_M |
                  USB_GINNAKEFF_M | USB_GOUTNAKEFF | USB_ERLYSUSP_M |
                  USB_ISOOUTDROP_M | USB_EOPF_M | USB_EPMIS_M |
                  USB_INCOMPISOIN_M | USB_INCOMPIP_M | USB_FETSUSP_M |
                  USB_PTXFEMP_M;
  ESP_EARLY_LOGI(LogTag, "USB interrupt %u done", intr_count);
}

void Esp32UsbDevice::bus_reset() {
  all_endpoints_nak();

  // clear the device address
  clear_bits(usb_->dcfg, USB_DEVADDR_M);

  usb_->daintmsk = USB_OUTEPMSK0_M | USB_INEPMSK0_M;
  usb_->doepmsk = USB_SETUPMSK_M | USB_XFERCOMPLMSK;
  usb_->diepmsk = USB_TIMEOUTMSK_M | USB_DI_XFERCOMPLMSK_M;

  // The Espressif tinyusb code uses 52 for the shared RX fifo size.
  // Note that this is 52 4-byte words, or 208 bytes total.
  //
  // They reference the "USB Data FIFOs" section of the reference manual,
  // also the technical reference manual copy I have (v1.0, which was just
  // released a few weeks ago) does not appear to explicitly document the RX
  // FIFO size recommendations that they reference.
  set_bits(usb_->grstctl, 0x10 << USB_TXFNUM_S); // fifo 0x10,
  set_bits(usb_->grstctl, USB_TXFFLSH_M);        // Flush fifo
  usb_->grxfsiz = 52;

  // Control IN uses FIFO 0 with 64 bytes ( 16 32-bit word )
  usb_->gnptxfsiz = (16 << USB_NPTXFDEP_S) | (usb_->grxfsiz & 0x0000ffffUL);

  // Ready to receive SETUP packet.
  set_bits(usb_->out_ep_reg[0].doeptsiz, USB_SUPCNT0_M);

  set_bits(usb_->gintmsk, USB_IEPINTMSK_M | USB_OEPINTMSK_M);
}

void Esp32UsbDevice::enum_done() {
  // The Device Status register (DSTS_REG) contains the enumerated speed
  // We pretty much always expect this to be Speed::Full48Mhz
  uint32_t enum_spd = (usb_->dsts >> USB_ENUMSPD_S) & (USB_ENUMSPD_V);
  ESP_EARLY_LOGI(LogTag, "USB int: enumeration done; speed=%d", enum_spd);

  uint16_t max_ep0_packet_size;
  if (enum_spd == Speed::Full48Mhz) {
    // Max packet size is 64 bytes
    clear_bits(usb_->in_ep_reg[0].diepctl, USB_D_MPS0_V);
    max_ep0_packet_size = 64;
  } else {
    // Max packet size is 8 bits
    set_bits(usb_->in_ep_reg[0].diepctl, USB_D_MPS0_V);
    max_ep0_packet_size = 8;
  }
  // Clear the stall bit
  clear_bits(usb_->in_ep_reg[0].diepctl, USB_D_STALL0_M);

  xfer_status_[0].out.max_size = max_ep0_packet_size;
  xfer_status_[0].in.max_size = max_ep0_packet_size;
  send_event_from_isr<BusResetEvent>(max_ep0_packet_size);
}

void Esp32UsbDevice::read_rx_fifo() {
  // USB_PKTSTS values from the comments in soc/usb_reg.h
  enum Pktsts : uint32_t {
    GlobalOutNak = 1,
    PktReceived = 2,
    TxComplete = 3,
    SetupComplete = 4,
    DataToggleError = 5, // host mode only
    SetupReceived = 6,
    ChannelHalted = 7, // host mode only
  };

  uint32_t const ctl_word = usb_->grxstsp;
  uint8_t const pktsts = (ctl_word & USB_PKTSTS_M) >> USB_PKTSTS_S;
  switch (pktsts) {
  case Pktsts::GlobalOutNak:
    ESP_EARLY_LOGI(LogTag, "USB RX: Global OUT NAK");
    break;
  case Pktsts::PktReceived: {
    uint8_t const endpoint_num = (ctl_word & USB_CHNUM_M) >> USB_CHNUM_S;
    uint16_t const byte_count = (ctl_word & USB_BCNT_M) >> USB_BCNT_S;
    ESP_EARLY_LOGI(LogTag, "USB RX: OUT packet received; size=%u", byte_count);
    receive_packet(endpoint_num, byte_count);
    break;
  }
  case Pktsts::TxComplete:
    // OUT packet done
    ESP_EARLY_LOGI(LogTag, "USB RX: OUT packet done");
    break;
  case Pktsts::SetupComplete: {
    // Setup OUT packet received.  After this we should receive an OUT endpoint
    // interrupt with the SETUP bit set.  We generate an event to handle the
    // SetupPacket there.
    uint8_t const endpoint_num = (ctl_word & USB_CHNUM_M) >> USB_CHNUM_S;
    ESP_EARLY_LOGI(LogTag, "USB RX: setup done");
    // Set the USB_SUPCNT0_M bits in the doeptsiz register, to indicate that
    // we can receive up to 3 DATA packets in this setup transfer.
    set_bits(usb_->out_ep_reg[endpoint_num].doeptsiz, USB_SUPCNT0_M);
    break;
  }
  case Pktsts::SetupReceived: {
    // We should receive a SetupComplete interrupt after SetupReceived.
    // We simply store the setup packet data here.
    volatile uint32_t *rx_fifo = usb_->fifo[0];
    setup_packet_.u32[0] = (*rx_fifo);
    setup_packet_.u32[1] = (*rx_fifo);
    ESP_EARLY_LOGI(LogTag,
                   "USB RX: setup packet: 0x%08x 0x%08x",
                   setup_packet_.u32[0],
                   setup_packet_.u32[1]);
    break;
  }
  default:
    ESP_EARLY_LOGE(LogTag, "USB RX: unexpected pktsts value: %x", pktsts);
    break;
  }
}

