simpkins/mantyl/src/components/mantyl_usb/Esp32UsbDevice.cpp
void Esp32UsbDevice::receive_packet(uint8_t endpoint_num, uint16_t packet_size) {
  // TODO: do this work in the main task rather than the interrupt handler?
  auto *xfer = &xfer_status_[endpoint_num].out;
  // All OUT transfers are performed using FIFO 0.
  volatile uint32_t *rx_fifo = usb_->fifo[0];

  // We can read up to the smaller of:
  // - the remaining size until the buffer is full
  // - the maximum transfer size for this endpoint
  // - or the packet_size argument
  //
  // TODO: If bufsize_left is less than packet_size, the host may have sent a
  // full packet but we are not able to read all of it.  I haven't played
  // around with how the ESP32 behaves in this case, but I think it will mess
  // up the current code's detection of end of transmission.  We probably
  // should require that start_out_read() always be called with a buffer size
  // that is a multiple of the maximum endpoint packet size.
  const uint16_t bufsize_left = xfer->buffer_size - xfer->received_bytes;
  uint16_t read_size =
      std::min(std::min(bufsize_left, xfer->max_size), packet_size);

  uint8_t *out_ptr = (xfer->buffer + xfer->received_bytes);
  uint8_t *const end = out_ptr + read_size;
  // Read 32-bit words at a time from the FIFO
  // Copy into out_ptr with memcmp, since out_ptr may not be word-aligned.
  while (out_ptr + 4 < end) {
    const uint32_t tmp = (*rx_fifo);
    memcpy(out_ptr, &tmp, 4);
    out_ptr += 4;
  }
  if (out_ptr < end) {
    const uint32_t tmp = (*rx_fifo);
    memcpy(out_ptr, &tmp, end - out_ptr);
  }

  xfer->received_bytes = end - xfer->buffer;

  // An OUT packet with a length less than the maximum endpoint packet size
  // always indicates the end of a transfer.
  xfer->recv_complete = (packet_size < xfer->max_size) ||
                        (xfer->received_bytes == xfer->buffer_size);
}

bool Esp32UsbDevice::transmit_packet(uint8_t endpoint_num, uint8_t fifo_num) {
  // TODO: do this work in the main task rather than the interrupt handler?
  ESP_EARLY_LOGI(LogTag, "USB: transmit_packet");

  auto &xfer = xfer_status_[endpoint_num].in;
  volatile usb_in_endpoint_t *in_ep = &usb_->in_ep_reg[endpoint_num];
  volatile uint32_t *tx_fifo = usb_->fifo[fifo_num];

  // soc/usb_reg.h documents the transfer size (USB_D_XFERSIZE0) only being
  // 8 bits wide, but it seems like it is actually 19 bits wide.
  uint16_t remaining = (in_ep->dieptsiz >> USB_D_XFERSIZE0_S) & 0x7FFFFU;
  uint16_t bytes_already_sent = xfer.size - remaining;
  uint16_t pkt_xfer_size = std::min(remaining, xfer.max_size);

  // Copy to the FIFO in 4-byte chunks
  uint16_t n = 0;
  const uint8_t *base = xfer.buffer + bytes_already_sent;
  for (/**/; n + 4 <= pkt_xfer_size; n += 4) {
    // Copy the data into a temporary uint32_t first before writing it to the
    // fifo.  This is needed since base[n] may not be 4-byte aligned,
    // and also to honor C/C++ strict aliasing rules.
    uint32_t u32 = base[n] | (base[n + 1] << 8) | (base[n + 2] << 16) |
                   (base[n + 3] << 24);
    ESP_EARLY_LOGI(LogTag, "USB tx: write 4");
    (*tx_fifo) = u32;
  }

  // Handle any remaining partial data
  if (n < pkt_xfer_size) {
    ESP_EARLY_LOGI(LogTag, "USB tx: write %d", pkt_xfer_size - n);
    uint32_t u32 = 0;
    u32 |= base[n];
    ++n;
    if (n < pkt_xfer_size) {
      u32 |= (base[n] << 8);
    }
    ++n;
    if (n < pkt_xfer_size) {
      u32 |= (base[n] << 16);
    }

    (*tx_fifo) = u32;
  }

  // Return true if we have written all data,
  // or false if more data is left to write.
  return (n == remaining);
}

void Esp32UsbDevice::handle_out_endpoint_intr() {
  for (uint8_t epnum = 0; epnum < USB_OUT_EP_NUM; ++epnum) {
    if (usb_->daint & (1 << (16 + epnum))) {
      handle_out_intr(epnum);
    }
  }
}

void Esp32UsbDevice::handle_in_endpoint_intr() {
  for (uint8_t epnum = 0; epnum < USB_IN_EP_NUM; ++epnum) {
    if (usb_->daint & (1 << epnum)) {
      handle_in_intr(epnum);
    }
  }
}

void Esp32UsbDevice::handle_out_intr(uint8_t epnum) {
  // Setup OUT transfer done.
  // This should presumably only happen for endpoint 0.
  if ((usb_->out_ep_reg[epnum].doepint & USB_SETUP0_M)) {
    ESP_EARLY_LOGI(LogTag, "USB: OUT SETUP received on EP%u", epnum);
    // Clear the interrupt bits
    usb_->out_ep_reg[epnum].doepint = USB_STUPPKTRCVD0_M | USB_SETUP0_M;
    send_event_from_isr<SetupPacket>(setup_packet_.setup);
  }

  // OUT transfer complete (one packet received)
  if (usb_->out_ep_reg[epnum].doepint & USB_XFERCOMPL0_M) {
    ESP_EARLY_LOGI(LogTag, "USB: OUT transfer complete on EP%u", epnum);
    // Clear the interrupt bit
    usb_->out_ep_reg[epnum].doepint = USB_XFERCOMPL0_M;

    auto &xfer = xfer_status_[epnum].out;
    // Transfer complete if short packet or total length is received
    if (xfer.recv_complete) {
      send_event_from_isr<OutXferCompleteEvent>(epnum, xfer.received_bytes);
    } else {
      // Schedule another packet to be received.
      set_bits(usb_->out_ep_reg[epnum].doeptsiz,
               USB_PKTCNT0_M |
                   ((xfer.max_size & USB_XFERSIZE0_V) << USB_XFERSIZE0_S));
      set_bits(usb_->out_ep_reg[epnum].doepctl, USB_EPENA0_M | USB_CNAK0_M);
    }
  }
}

void Esp32UsbDevice::handle_in_intr(uint8_t epnum) {
  ESP_EARLY_LOGI(LogTag, "USB IN interrupt: EP%u", epnum);
  // IN transfer complete
  if (usb_->in_ep_reg[epnum].diepint & USB_D_XFERCOMPL0_M) {
    ESP_EARLY_LOGI(LogTag, "USB: IN transfer complete on EP%u", epnum);
    usb_->in_ep_reg[epnum].diepint = USB_D_XFERCOMPL0_M;
    auto *xfer = &xfer_status_[epnum].in;
    send_event_from_isr<InXferCompleteEvent>(epnum, xfer->size);
  }

  // FIFO empty
  if (usb_->in_ep_reg[epnum].diepint & USB_D_TXFEMP0_M) {
    ESP_EARLY_LOGI(LogTag, "USB IN FIFO empty: EP%u", epnum);
    usb_->in_ep_reg[epnum].diepint = USB_D_TXFEMP0_M;
    const bool all_sent = transmit_packet(epnum, epnum);
    // Turn off the FIFO empty interrupt if all bytes have been written
    if (all_sent) {
      ESP_EARLY_LOGI(LogTag, "USB: clear fifo empty interrupt");
      clear_bits(usb_->dtknqr4_fifoemptymsk, 1 << epnum);
    }
  }

  // Transfer timeout
  if (usb_->in_ep_reg[epnum].diepint & USB_D_TIMEOUT0_M) {
    ESP_EARLY_LOGW(LogTag, "USB IN transfer timeout on EP%u", epnum);
    // Clear interrupt or endpoint will hang.
    usb_->in_ep_reg[epnum].diepint = USB_D_TIMEOUT0_M;
    send_event_from_isr<InXferFailedEvent>(epnum);
  }
}

void Esp32UsbDevice::set_address(uint8_t address) {
  set_bits(usb_->dcfg, (address & USB_DEVADDR_V) << USB_DEVADDR_S);
}

void Esp32UsbDevice::stall_in_endpoint(uint8_t endpoint_num) {
  usb_in_endpoint_t *in_ep = &(usb_->in_ep_reg[0]);

  if ((endpoint_num == 0) || !(in_ep[endpoint_num].diepctl & USB_D_EPENA1_M)) {
    // For endpoint 0 and other endpoints that are already disabled,
    // just set the NAK and STALL flags.
    set_bits(in_ep[endpoint_num].diepctl, USB_DI_SNAK1_M | USB_D_STALL1_M);
  } else {
    // Set USB_DI_SNAK1_M to NAK transfers.
    set_bits(in_ep[endpoint_num].diepctl, USB_DI_SNAK1_M);
    while ((in_ep[endpoint_num].diepint & USB_DI_SNAK1_M) == 0) {
      // Busy loop until we observe the USB_DI_SNAK1_M interrupt flag.
      // TODO: It would ideally be nicer to make this API asynchronous, and
      // finish the operation in the interrupt handler rather than busy
      // looping.
    }

    // Disable the endpoint and also set the STALL flag.
    // NAK is also still set.
    set_bits(in_ep[endpoint_num].diepctl,
             USB_DI_SNAK1_M | USB_D_STALL1_M | USB_D_EPDIS1_M);
    while ((in_ep[endpoint_num].diepint & USB_D_EPDISBLD0_M) == 0) {
      // Busy loop until we observe the USB_D_EPDISBLD0_M interrupt flag.
    }
    // Clear the USB_D_EPDISBLD0_M interrupt.
    in_ep[endpoint_num].diepint = USB_D_EPDISBLD0_M;
  }

