simpkins/mantyl/src/components/mantyl_usb/Esp32UsbDevice.cpp
  // Flush the transmit FIFO.
  uint8_t const fifo_num =
      ((in_ep[endpoint_num].diepctl >> USB_D_TXFNUM1_S) & USB_D_TXFNUM1_V);
  set_bits(usb_->grstctl, fifo_num << USB_TXFNUM_S);
  set_bits(usb_->grstctl, USB_TXFFLSH_M);
  while ((usb_->grstctl & USB_TXFFLSH_M) != 0) {
    // Busy loop until the FIFO has been cleared.
  }
}

void Esp32UsbDevice::stall_out_endpoint(uint8_t endpoint_num) {
  usb_out_endpoint_t *out_ep = &(usb_->out_ep_reg[0]);

  // Only disable currently enabled non-control endpoint
  if ((endpoint_num == 0) || !(out_ep[endpoint_num].doepctl & USB_EPENA0_M)) {
    // For endpoint 0 and other endpoints that are already disabled,
    // just set the STALL flag.
    set_bits(out_ep[endpoint_num].doepctl, USB_STALL0_M);
  } else {
    // Enable the Global NAK flag.
    set_bits(usb_->dctl, USB_SGOUTNAK_M);
    while ((usb_->gintsts & USB_GOUTNAKEFF_M) == 0) {
      // Busy loop until we have seen the USB_GOUTNAKEFF_M interrupt.
      // TODO: It would ideally be nicer to make this API asynchronous, and
      // finish the operation in the interrupt handler rather than busy
      // looping.
    }

    // Disable the endpoint, and set the STALL flag.
    set_bits(out_ep[endpoint_num].doepctl, USB_STALL0_M | USB_EPDIS0_M);
    while ((out_ep[endpoint_num].doepint & USB_EPDISBLD0_M) == 0) {
      // Busy loop until we have seen the endpoint disabled interrupt.
    }
    out_ep[endpoint_num].doepint = USB_EPDISBLD0_M;

    // Clear the Global NAK flag to allow other OUT endpoints to continue
    // functioning.
    set_bits(usb_->dctl, USB_CGOUTNAK_M);
  }
}

void Esp32UsbDevice::clear_in_stall(uint8_t endpoint_num) {
  usb_in_endpoint_t *in_ep = &(usb_->in_ep_reg[0]);
  clear_bits(in_ep[endpoint_num].diepctl, USB_D_STALL1_M);

  // Reset the DATA0/1 toggle bit to DATA0 after a stall on interrupt and bulk
  // transfer endpoints.
  const auto eptype = static_cast<EndpointType>(
      (in_ep[endpoint_num].diepctl & USB_D_EPTYPE1_M) >> USB_D_EPTYPE1_S);
  if (eptype == EndpointType::Interrupt || eptype == EndpointType::Bulk) {
    set_bits(in_ep[endpoint_num].diepctl, USB_DI_SETD0PID1_M);
  }
}

void Esp32UsbDevice::clear_out_stall(uint8_t endpoint_num) {
  usb_out_endpoint_t *out_ep = &(usb_->out_ep_reg[0]);
  clear_bits(out_ep[endpoint_num].doepctl, USB_STALL1_M);

  // Reset the DATA0/1 toggle bit to DATA0 after a stall on interrupt and bulk
  // transfer endpoints.
  const auto eptype = static_cast<EndpointType>(
      (out_ep[endpoint_num].doepctl & USB_EPTYPE1_M) >> USB_EPTYPE1_S);
  if (eptype == EndpointType::Interrupt || eptype == EndpointType::Bulk) {
    set_bits(out_ep[endpoint_num].doepctl, USB_DO_SETD0PID1_M);
  }
}

void Esp32UsbDevice::start_in_send(uint8_t endpoint_num,
                                   const uint8_t *buffer,
                                   uint16_t size) {
  // TODO: Keep track of endpoint busy status, and reject a new transfer if
  // one is already in progress.  Or perhaps queue it?
  auto &xfer = xfer_status_[endpoint_num].in;
  xfer.buffer = buffer;
  xfer.size = size;

  // For a 0-byte message we still need 1 packet.
  // Otherwise compute the number of packets needed.
  const uint16_t num_packets = size == 0 ? 1 : 1 + ((size - 1) / xfer.max_size);

  ESP_EARLY_LOGI(LogTag,
                 "USB IN transfer EP%u, %u bytes in %u packets",
                 endpoint_num,
                 size,
                 num_packets);

  // Schedule the transfer
  // Set dieptsiz so we will get a transfer complete interrupt when done.
  usb_->in_ep_reg[endpoint_num].dieptsiz =
      (num_packets << USB_D_PKTCNT0_S) | (size << USB_D_XFERSIZE0_S);
  // Enable the endpoint, and clear the NAK bit.
  set_bits(usb_->in_ep_reg[endpoint_num].diepctl,
           USB_D_EPENA1_M | USB_D_CNAK1_M);

  // If we have data to send, enable the fifo empty interrupt to
  // notify us when we can put data in the fifo.
  if (size != 0) {
    set_bits(usb_->dtknqr4_fifoemptymsk, 1 << endpoint_num);
  }
}

void Esp32UsbDevice::start_out_read(uint8_t endpoint_num,
                                    uint8_t *buffer,
                                    uint16_t buffer_size) {
  auto &xfer = xfer_status_[endpoint_num].out;
  xfer.buffer = buffer;
  xfer.buffer_size = buffer_size;
  xfer.received_bytes = 0;
  xfer.recv_complete = false;

  ESP_EARLY_LOGI(LogTag,
                 "Prepare for USB OUT receive EP%u, up to %u bytes",
                 endpoint_num,
                 buffer_size);

  // Schedule the OUT transfer.
  // Each complete packet will trigger an XFRC interrupt.
  set_bits(usb_->out_ep_reg[endpoint_num].doeptsiz,
           USB_PKTCNT0_M |
               ((xfer.max_size & USB_XFERSIZE0_V) << USB_XFERSIZE0_S));
  set_bits(usb_->out_ep_reg[endpoint_num].doepctl, USB_EPENA0_M | USB_CNAK0_M);
}

uint8_t Esp32UsbDevice::get_free_fifo() {
  if (allocated_fifos_ < kMaxInFIFOs) {
    return allocated_fifos_++;
  }
  return 0;
}

void Esp32UsbDevice::close_all_endpoints() {
  usb_out_endpoint_t *out_ep = &(usb_->out_ep_reg[0]);
  usb_in_endpoint_t *in_ep = &(usb_->in_ep_reg[0]);

  // Disable non-control interrupt
  usb_->daintmsk = USB_OUTEPMSK0_M | USB_INEPMSK0_M;

  for (uint8_t n = 1; n < xfer_status_.size(); n++) {
    // disable OUT endpoint
    out_ep[n].doepctl = 0;
    xfer_status_[n].out.max_size = 0;

    // disable IN endpoint
    in_ep[n].diepctl = 0;
    xfer_status_[n].in.max_size = 0;
  }

  allocated_fifos_ = 1;
}

} // namespace mantyl
